In [1]:
print("Welcome to SQL")

Welcome to SQL

## Steps for installing and connceting mysql 
# üß† MySQL & Python Integration: Full Setup Guide (macOS + Jupyter)

---

## ‚úÖ PART 1: Install MySQL on macOS using Homebrew

### üñ• In Terminal:
```bash
brew update
brew install mysql
brew services start mysql      # Start MySQL server
```

### ‚úÖ Check MySQL is running:
```bash
mysqladmin -u root -p version
```

---

## ‚úÖ PART 2: Login to MySQL (initially no password)
```bash
mysql -u root
```

---

## ‚úÖ PART 3: Set Password for Root User

### üîí Inside MySQL shell:
```sql
ALTER USER 'root'@'localhost' IDENTIFIED BY 'your_secure_password';
FLUSH PRIVILEGES;
```

> Example:
```sql
ALTER USER 'root'@'localhost' IDENTIFIED BY 'coolNeon@23';
```

---

## ‚úÖ PART 4: Exit MySQL Shell
```sql
exit;
```

---

## ‚úÖ PART 5: Log in again with password (in Terminal)
```bash
mysql -u root -p
```
> Enter password: `coolNeon@23`

---

## ‚úÖ PART 6: Create Database & User (optional)

### üîß In MySQL shell:
```sql
CREATE DATABASE test_db;

CREATE USER 'myuser'@'localhost' IDENTIFIED BY 'mypassword';

GRANT ALL PRIVILEGES ON test_db.* TO 'myuser'@'localhost';

FLUSH PRIVILEGES;
```

---

## ‚úÖ PART 7: Select a Database

```sql
USE test_db;
SELECT DATABASE();
```

---

## ‚úÖ PART 8: Install MySQL Connector for Python (Jupyter)

### üêç In Jupyter notebook cell:
```python
!pip install mysql-connector-python
```

---

## ‚úÖ PART 9: Connect to MySQL from Python

```python
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",                    # or 'myuser'
    password="coolNeon@23",        # or 'mypassword'
    database="test_db"             # optional if not using yet
)

cursor = conn.cursor()
cursor.execute("SELECT DATABASE();")
print("Connected to:", cursor.fetchone())

cursor.close()
conn.close()
```

---

## ‚úÖ BONUS: Load SQL Query into pandas DataFrame

```python
import pandas as pd

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="coolNeon@23",
    database="test_db"
)

query = "SELECT * FROM your_table;"
df = pd.read_sql(query, conn)

conn.close()
print(df.head())

In [2]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.3.0-cp312-cp312-macosx_14_0_x86_64.whl.metadata (7.5 kB)
Downloading mysql_connector_python-9.3.0-cp312-cp312-macosx_14_0_x86_64.whl (16.0 MB)
   ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ‚îÅ 16.0/16.0 MB 4.0 MB/s eta 0:00:0000:0100:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.3.0

In [9]:
import mysql.connector

# Connect to MySQL
conn = mysql.connector.connect(
    host="localhost",       # or your MySQL host
    user="root",
    password="coolNeon@23",
    database="demo"
)

cursor = conn.cursor()

# Example query
cursor.execute("SELECT DATABASE();")
result = cursor.fetchone()
print("Connected to database:", result)

#cursor.close()
#conn.close()

Connected to database: ('demo',)


# AS for data science aim we will use sqlalchemy with pymsql as shown below

In [32]:
import pandas as pd
from sqlalchemy import create_engine,text
engine = create_engine("mysql+pymysql://root:coolNeon%4023@localhost:3306/demo")
query="DESCRIBE house_mate;"
pd.read_sql(query, engine)

     Field          Type Null  Key Default Extra
0     name  varchar(100)  YES         None
1  room no           int   NO  PRI    None
2     rent         float  YES         None

In [33]:
! pip install pymysql

Requirement already satisfied: pymysql in /opt/anaconda3/lib/python3.12/site-packages (1.1.1)

In [34]:
pd.read_sql("SHOW TABLES;", engine)

  Tables_in_demo
0     house_mate

In [35]:
pd.read_sql("INSERT INTO house_mate(name,`room no`, rent) VALUES ('Newton', 12, 100),('Issac', 20,150);",engine)

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [36]:
pd.read_sql("SELECT * FROM house_mate;", engine)

    name  room no   rent
0  karan        1  200.0
1  Issac        2  300.0

## VVIP NOTE:
#### In Python, when working with databases using SQLAlchemy and Pandas (e.g., in Jupyter), use `pd.read_sql()` only for `SELECT` queries that retrieve data, returning the results as a Pandas DataFrame for analysis. For all other SQL operations like `INSERT`, `UPDATE`, `DELETE`, `CREATE TABLE`, or any command that modifies the database, use `conn.execute()`, which executes the query but does not return a result set. If you want to insert an entire DataFrame into a SQL table, use `df.to_sql()`, which allows batch writing with options like `if_exists='append'`. Remember, `pd.read_sql()` is strictly for reading data‚Äîany write operation requires `conn.begin()` instead.

In [46]:
# text() method.
query=text("""INSERT INTO house_mate(name,`room no`, rent) VALUES ('Newton', 112, 100),('Issac', 210,150);""")
with engine.begin() as conn:
    conn.execute(query)

In [47]:
pd.read_sql("SELECT * FROM house_mate ;", engine)

     name  room no   rent
0   karan        1  200.0
1   Issac        2  300.0
2  Newton       12  100.0
3   Issac       20  150.0
4  Newton      112  100.0
5   Issac      210  150.0

# Imp Note on text():
                    The `text()` function in SQLAlchemy is used to safely execute plain SQL queries such as `INSERT`, `DELETE`, `UPDATE`, and complex `SELECT` statements. It wraps raw SQL strings so that SQLAlchemy can correctly parse and execute them, making it especially useful for write operations and parameterized queries that help prevent SQL injection. While `text()` is not required for ORM-style queries or when using `pd.read_sql()` with simple `SELECT` statements, it becomes essential when you're working with direct SQL inside `conn.execute()` or `engine.begin()` blocks. For data science workflows that rely on quick SQL access rather than full ORM models, `text()` provides a clean and secure way to run raw SQL within Python.